<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.install.InstallScratch2</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://scratch.mit.edu/scratchr2/static/sa/Scratch-460.0.1.dmg</string>
		<key>NAME</key>
		<string>Install Scratch 2</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.lwc512.install.InstallScratch2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.lwc512.download.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>f900cc5fe713abd3a86d7e5448e6f45b00c6cf9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.autopkg/download/InstallScratch2.download.recipe</string>
				<key>sha256_hash</key>
				<string>b241dc67bfe1b736b2d8cdf15feb280e5da534b49d4eccae55f618ceb6b50fa8</string>
			</dict>
			<key>com.github.lwc512.install.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>f900cc5fe713abd3a86d7e5448e6f45b00c6cf9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.autopkg/download/InstallScratch2.install.recipe</string>
				<key>sha256_hash</key>
				<string>45b9e3a0bcec4c4b7fa21e932fac8569660084073d14add94731d5692b1b32e2</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
