<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.pkg.InstallScratch2</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>edu.media.mit.Scratch2Editor.installer</string>
		<key>DOWNLOAD_URL</key>
		<string>https://scratch.mit.edu/scratchr2/static/sa/Scratch-460.0.1.dmg</string>
		<key>NAME</key>
		<string>Install Scratch 2</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.lwc512.pkg.InstallScratch2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.lwc512.download.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>f900cc5fe713abd3a86d7e5448e6f45b00c6cf9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.autopkg/download/InstallScratch2.download.recipe</string>
				<key>sha256_hash</key>
				<string>b241dc67bfe1b736b2d8cdf15feb280e5da534b49d4eccae55f618ceb6b50fa8</string>
			</dict>
			<key>com.github.lwc512.pkg.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>f900cc5fe713abd3a86d7e5448e6f45b00c6cf9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.autopkg/download/InstallScratch2.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>90b79a1db04cc90cdb6920b2f1ffcbeb084844a47f3acaae406e4e046986408f</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
