<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.InstallScratch2</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://scratch.mit.edu/scratchr2/static/sa/Scratch-460.0.1.dmg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Install Scratch 2</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Code-to-Learn Foundation</string>
			<key>display_name</key>
			<string>Install Scratch 2</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.lwc512.munki.InstallScratch2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.lwc512.download.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>f900cc5fe713abd3a86d7e5448e6f45b00c6cf9c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.autopkg/download/InstallScratch2.download.recipe</string>
				<key>sha256_hash</key>
				<string>b241dc67bfe1b736b2d8cdf15feb280e5da534b49d4eccae55f618ceb6b50fa8</string>
			</dict>
			<key>com.github.lwc512.munki.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>45e54dbf1c887eb3a369fec1cfb27296b31e5732</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.autopkg/download/InstallScratch2.munki.recipe</string>
				<key>sha256_hash</key>
				<string>f373068b3515de59ca8083e1787a118eb3621bdddd003ec6b8bf370fdfdf47ad</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
