<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of Install Scratch 2.</string>
	<key>Identifier</key>
	<string>com.github.lwc512.install.InstallScratch2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>InstallScratch2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.lwc512.download.InstallScratch2</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.lwc512.download.InstallScratch2</key>
			<dict>
				<key>git_hash</key>
				<string>c00e00d8c6e1a61a3e2951943fd98cab707b1034</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.lwc512.School/Scratch2/InstallScratch2.download.recipe</string>
				<key>sha256_hash</key>
				<string>f1d7613f261ccb4825f82aa368ad976158eef8c5aad0e8524d538ecf2459ee0e</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>/Applications</string>
						<key>source_item</key>
						<string>InstallScratch2.app</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
